// Инициализация переменных
interaction_distance = 64;  // Расстояние до игрока

// Текст-подсказка
interaction_text = "Чтож, это просто тест";

// Переменная для отслеживания состояния спрайта
//sprite_state = 0;

//sprite_1 = ; // Первый спрайт
//sprite_2 = ;  // Второй спрайт

// Устанавливаем начальный спрайт
//sprite_index = sprite_1;

// Переменная для проверки, может ли игрок взаимодействовать
can_interact = false;

// Переменная для предотвращения множественного нажатия
key_pressed = false;

// Настройки взаимодействия
player_nearby = false;       // Рядом ли игрок
